a string defined with double quotes
foo bar
foo bar gnu
foobargnu
foo-bar-gnu
foo, bar, gnu
foobar
foo-bar
foo,
bar
you can add strings using the + operator
0
10

foo
foo bar
foobargnu
9
line1
line2
	a tab character
line1
line2
	a tab character
"using double quotes in double quoted string"
'using single quotes in single quoted string'
x = foo
foobar
x = foo
x = bar
0 1 2 3 99
-99 -3 -2 -1
0.0 0.01 0.5 2.718
-2.718 -0.5 -0.01
0 99
0.0 99.0
3
2
6
9
3.0
2.0
6.0
9.0
2.0
2.0
1.5
2.0
121.0
121.0
True False
True False
False True
True
False
False
False
True
True
True
False
False
True
[]
['a', 'b', 'c']
[1, 2, 3]
[[], [1], [1, 2]]
[1, 3.14, 'foo', ['bar']]
[]
[0.01, 0.1, 1.0]
[[], [1], [1, 2]]
0
3
[[], [1], [1, 2]]
2
3
[1, 2, 3, 4, 5, 6]
['a', 'b', 'c', 'd', 'e', 'f']
[1, 2]
foo
bar
gnu
2
['a', 'b', 'c', 'foo']
830> True
834> False
850> True
854> False
863> True
867> False
883> False
886> False
889> False
892> False
895> False
898> False
899> False
916> True
920> True
930> True
931> True
935> True
936> True
948> True
951> True
954> True
967> True
968> True
969> True
970> True
980> True
981> True
982> True
983> True
986> False
987> False
988> False
989> False
1028> True
1029> True
1030> True
1031> True
1041> True
1042> True
1043> True
1044> True
1045> True
1046> True
1047> True
1074> True
1096> True
1100> False
1104> False
1117> True
1121> True
1125> True
1129> False
