a string defined with double quotes
foo bar
foo bar gnu
foobargnu
foo-bar-gnu
foo, bar, gnu
foobar
foo-bar
foo,
bar
you can add strings using the + operator
0
10

foo
foo bar
foobargnu
9
line1
line2
	a tab character
line1
line2
	a tab character
"using double quotes in double quoted string"
'using single quotes in single quoted string'
x = foo
foobar
x = foo
x = bar
0 1 2 3 99
-99 -3 -2 -1
0.0 0.01 0.5 2.718
-2.718 -0.5 -0.01
0 99
0.0 99.0
3
2
6
9
3.0
2.0
6.0
9.0
2.0
2.0
1.5
2.0
121.0
121.0
True False
True False
False True
True
False
False
False
True
True
True
False
False
True
[]
['a', 'b', 'c']
[1, 2, 3]
[[], [1], [1, 2]]
[1, 3.14, 'foo', ['bar']]
[]
[0.01, 0.1, 1.0]
[[], [1], [1, 2]]
0
3
[[], [1], [1, 2]]
2
3
[1, 2, 3, 4, 5, 6]
['a', 'b', 'c', 'd', 'e', 'f']
[1, 2]
foo
bar
gnu
2
['a', 'b', 'c', 'foo']
831> True
835> False
851> True
855> False
864> True
868> False
884> False
887> False
890> False
893> False
896> False
899> False
900> False
917> True
921> True
931> True
932> True
936> True
937> True
949> True
952> True
955> True
968> True
969> True
970> True
971> True
981> True
982> True
983> True
984> True
987> False
988> False
989> False
990> False
1029> True
1030> True
1031> True
1032> True
1042> True
1043> True
1044> True
1045> True
1046> True
1047> True
1048> True
1075> True
1097> True
1101> False
1105> False
1118> True
1122> True
1126> True
1130> False
foo
bar
gnu
1224> foo
1225> foo
1224> bar
1225> bar
1224> gnu
1225> gnu
1238> a
1239> A
1238> b
1239> B
1238> c
1239> C
1238> d
1239> D
1238> e
1239> E
1238> f
1239> F
1251> 1 1
1251> 2 3
1251> 3 6
1267> ac
1267> ad
1267> bc
1267> bd
